In [2]:
import pandas as pd

In [19]:
import numpy as np

In [4]:
data = pd.read_csv('data_science_job.csv')

In [7]:
data[:6]

,work_year,job_title,job_category,salary_currency,salary,salary_in_usd,employee_residence,experience_level,employment_type,work_setting,company_location,company_size
0,2022,Machine Learning Engineer in office,Analysis,EUR,186597,136086,US,MI,CT,Remote,DE,L
1,2020,Statistician (Remote),ML/AI,JPY,110630,67982,JP,EX,FL,Remote,IN,M
2,2022,Machine Learning Engineer,ML/AI,INR,61280,153309,UK,MI,CT,Hybrid,CN,L
3,2022,Data Analyst in office,ML/AI,JPY,154130,135242,DE,SE,FT,Hybrid,MX,L
4,2020,Statistician,Data Science,EUR,172312,35156,UK,MI,FT,In-person,UK,S
5,2020,Machine Learning Engineer,Engineering,JPY,36544,68280,CN,MI,FT,Hybrid,DE,M

In [16]:
data.loc[3, 'employment_type':]

employment_type         FT
work_setting        Hybrid
company_location        MX
company_size             L
Name: 3, dtype: object

In [15]:
data.loc[1:3,'job_category':'salary']

  job_category salary_currency  salary
1        ML/AI             JPY  110630
2        ML/AI             INR   61280
3        ML/AI             JPY  154130

In [8]:
data.head()

,work_year,job_title,job_category,salary_currency,salary,salary_in_usd,employee_residence,experience_level,employment_type,work_setting,company_location,company_size
0,2022,Machine Learning Engineer in office,Analysis,EUR,186597,136086,US,MI,CT,Remote,DE,L
1,2020,Statistician (Remote),ML/AI,JPY,110630,67982,JP,EX,FL,Remote,IN,M
2,2022,Machine Learning Engineer,ML/AI,INR,61280,153309,UK,MI,CT,Hybrid,CN,L
3,2022,Data Analyst in office,ML/AI,JPY,154130,135242,DE,SE,FT,Hybrid,MX,L
4,2020,Statistician,Data Science,EUR,172312,35156,UK,MI,FT,In-person,UK,S

In [17]:
data.loc[4,['salary_currency','experience_level']]

salary_currency     EUR
experience_level     MI
Name: 4, dtype: object

In [22]:
data1d = [1,2,3,4,5]
data_array = np.array(data1d)

In [23]:
data_array[[2,4]]

array([3, 5])

In [25]:
data.loc[[4,7],['salary_currency','experience_level']]

  salary_currency experience_level
4             EUR               MI
7             JPY               EX

In [32]:
data.loc[[10,13],'salary_currency']

10    us dolars
13    us dolars
Name: salary_currency, dtype: object

In [33]:
data.loc[[10,13],['job_title','job_category']]

                   job_title  job_category
10  Data Engineer  in office  Data Science
13            Statistician     Engineering

In [34]:
data.loc[[10,13],'job_title':'job_category']

                   job_title  job_category
10  Data Engineer  in office  Data Science
13            Statistician     Engineering

In [35]:
data.head(10)

,work_year,job_title,job_category,salary_currency,salary,salary_in_usd,employee_residence,experience_level,employment_type,work_setting,company_location,company_size
0,2022,Machine Learning Engineer in office,Analysis,EUR,186597,136086,US,MI,CT,Remote,DE,L
1,2020,Statistician (Remote),ML/AI,JPY,110630,67982,JP,EX,FL,Remote,IN,M
2,2022,Machine Learning Engineer,ML/AI,INR,61280,153309,UK,MI,CT,Hybrid,CN,L
3,2022,Data Analyst in office,ML/AI,JPY,154130,135242,DE,SE,FT,Hybrid,MX,L
4,2020,Statistician,Data Science,EUR,172312,35156,UK,MI,FT,In-person,UK,S
5,2020,Machine Learning Engineer,Engineering,JPY,36544,68280,CN,MI,FT,Hybrid,DE,M
6,2022,Data Analyst in office,Data Science,JPY,178404,105324,DE,EX,PT,Remote,DE,L
7,2021,Data Scientist (Remote),ML/AI,JPY,187908,90706,UK,EX,CT,Remote,JP,M
8,2022,Data Analyst,NaN,NaN,-44388,171043,UK,NaN,FL,In-person,DE,NaN
9,2022,Statistician (Remote),Engineering,us dolars,31694,73408,DE,EN,CT,Remote,US,S

In [48]:
data.iloc[1,4],[['salary_in_usd', 'job_category']]

(110630, [['salary_in_usd', 'job_category']])

In [50]:
data.iloc[1:4,[5, 9]]

   salary_in_usd work_setting
1          67982       Remote
2         153309       Hybrid
3         135242       Hybrid

In [36]:
data.loc[1:10,'salary_currency':'salary_in_usd']

   salary_currency  salary  salary_in_usd
1              JPY  110630          67982
2              INR   61280         153309
3              JPY  154130         135242
4              EUR  172312          35156
5              JPY   36544          68280
6              JPY  178404         105324
7              JPY  187908          90706
8              NaN  -44388         171043
9        us dolars   31694          73408
10       us dolars  157727         167559

In [39]:
data.iloc[10:15,-4:]

   employment_type work_setting company_location company_size
10              FL       Hybrid               US            S
11              FL    In-person               UK            M
12              FL    In-person               DE          NaN
13              CT    In-person               JP            M
14              FT       Hybrid               CN            M

In [9]:
data.tail()

,work_year,job_title,job_category,salary_currency,salary,salary_in_usd,employee_residence,experience_level,employment_type,work_setting,company_location,company_size
4995,2020,Machine Learning Engineer (Remote),NaN,NaN,179769,179111,UK,NaN,CT,In-person,IN,NaN
4996,2021,Machine Learning Engineer (Remote),NaN,NaN,184642,196373,CN,NaN,FL,Remote,UK,NaN
4997,2022,Machine Learning Engineer,Analysis,GBP,135319,51366,UK,EN,FL,Hybrid,JP,M
4998,2021,Statistician,Data Science,EUR,58037,181817,US,MI,PT,Remote,DE,S
4999,2020,Data Scientist (Remote),Engineering,GBP,143565,172425,CN,EX,CT,Remote,CN,L

In [12]:
data[['salary','salary_in_usd']]

      salary  salary_in_usd
0     186597         136086
1     110630          67982
2      61280         153309
3     154130         135242
4     172312          35156
...      ...            ...
4995  179769         179111
4996  184642         196373
4997  135319          51366
4998   58037         181817
4999  143565         172425

[5000 rows x 2 columns]

In [53]:
data.loc[[1,6],['work_setting','work_year']]

  work_setting  work_year
1       Remote       2020
6       Remote       2022

In [57]:
data.loc[1:6,'work_year':'work_setting']

,work_year,job_title,job_category,salary_currency,salary,salary_in_usd,employee_residence,experience_level,employment_type,work_setting
1,2020,Statistician (Remote),ML/AI,JPY,110630,67982,JP,EX,FL,Remote
2,2022,Machine Learning Engineer,ML/AI,INR,61280,153309,UK,MI,CT,Hybrid
3,2022,Data Analyst in office,ML/AI,JPY,154130,135242,DE,SE,FT,Hybrid
4,2020,Statistician,Data Science,EUR,172312,35156,UK,MI,FT,In-person
5,2020,Machine Learning Engineer,Engineering,JPY,36544,68280,CN,MI,FT,Hybrid
6,2022,Data Analyst in office,Data Science,JPY,178404,105324,DE,EX,PT,Remote

In [61]:
data.loc[[1,6],'work_year':'work_setting']

,work_year,job_title,job_category,salary_currency,salary,salary_in_usd,employee_residence,experience_level,employment_type,work_setting
1,2020,Statistician (Remote),ML/AI,JPY,110630,67982,JP,EX,FL,Remote
6,2022,Data Analyst in office,Data Science,JPY,178404,105324,DE,EX,PT,Remote

In [62]:
data.loc[1:6,['work_year','work_setting']]

   work_year work_setting
1       2020       Remote
2       2022       Hybrid
3       2022       Hybrid
4       2020    In-person
5       2020       Hybrid
6       2022       Remote